reference_cfd/openfoam_v2606/flat_plate/coarse/0/alphat
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object alphat;
}

dimensions [1 -1 -1 0 0 0 0];
internalField uniform 0;

boundaryField
{
    airInlet
    {
        type calculated;
        value uniform 0;
    }
    targetWall
    {
        type compressible::alphatWallFunction;
        value uniform 0;
    }
    farField
    {
        type calculated;
        value uniform 0;
    }
}
